<template>
    <div class="userAgreement">
        <v-title-header :title='title'></v-title-header>
        <div class="content">
            <p>尊敬的用户，欢迎阅读本协议</p>
            <p>占星依据本协议的规定提供服务，本协议具有合同效力。您必须完全同意以下所有条款，才能保证享受到更好的占星服务。您使用服务的行为将视为对本协议的接受，并同意接受本协议各项条款的约束。</p>
            <br>
            <p>用户在申请占星服务过程中，需要填写一些必要的个人信息，为了更好的为用户服务，请保证提供的这些个人信息的真实、准确、合法、有效并注意及时更新。若因填写的信息不完整或不准确，则可能无法使用本服务或在使用过程中受到限制。如因用户提供的个人资料不实或不准确，给用户自身造成任何性质的损失，均由用户自行承担。</p>
            <br>
            <p>保护用户个人信息是占星的一项基本原则，占星运用各种安全技术和程序建立完善的管理制度来保护用户的个人信息，以免遭受未经授权的访问、使用或披露。未经用户许可占星不会向第三方（占星或关联、运营合作单位除外）公开、透露用户个人信息，但由于政府要求、法律政策需要等原因除外。</p>
            <br>
            <p>在用户发送信息的过程中和本应用收到信息后，本应用将遵守行业通用的标准来保护用户的私人信息。但是任何通过因特网发送的信息或电子版本的存储方式都无法确保100%的安全性。因此，本应用会尽力使用商业上可接受的方式来保护用户的个人信息，但不对用户信息的安全作任何担保。</p>
            <br>
            <p>本应用有权在必要时修改服务条例，本应用的服务条例一旦发生变动，将会在本应用的重要页面上提示修改内容，用户如不同意新的修改内容，须立即停止使用本协议约定的服务，否则视为用户完全同意并接受新的修改内容。根据客观情况及经营方针的变化，本应用有中断或停止服务的权利，用户对此表示理解并完全认同。</p>
            <br>
            <p>如果您还有其他问题和建议，可以通过电子邮件service@szmonster.com联系我们。</p>
            <br>
            <br>
        </div>
    </div>
</template>
<script>
export default {
    name : 'UserAgreement',
    data() {
        return {
            title : '注册协议'
        }
    }
}
</script>
<style lang="less" scoped>
.content {
    text-align: center;
    margin: 24/75rem auto;
    width: 646/75rem;
    p {
        text-indent: 2em;
        font-size: 26/75rem;
    }
}
</style>


